Repository: wasawarded/PPE_website_marche_sur_la_lune
Catalog: DATA/aligement_texte_ar_fr.tmx
Source language: ar
Languages: fr

source: يرجع أصل كلمة منطق «logic» إلى الكلمة اليونانية «logos» والتي تقابلها ترجمات عدة، كالعقل والخطاب واللغة.
fr: Le mot "logique" trouve ses racines dans le terme grec <strong>logos</strong>, qui revêt plusieurs significations, telles que l'esprit, la parole et le langage.

source: يُعرف المنطق تقليديًا بأنه دراسة قوانين التفكير أو التفكير الصحيح، ويُفهم عادة من حيث الاستدلالات أو الحجج.
fr: Traditionnellement, la logique se définit comme l'étude des lois qui régissent le raisonnement ou la pensée correcte.

source: والحجج هي التعبير الظاهري عن الاستدلالات.
fr: Elle se concentre principalement sur les inférences ou les arguments, ces derniers étant l'expression formelle des inférences.

source: الحجة مجموعة من المقدمات رفقة استنتاج.
fr: Un argument se compose d'un ensemble de prémisses menant à une conclusion.

source: تنطبق هذه التوصيفات العامة على المنطق بأوسع معانيه، أي على كل من المنطق الصوري وغير الصوري نظرًا إلى أن كلاهما يُعنى بتقييم صحة الحجج.
fr: Cette définition générale englobe deux grandes branches : la logique formelle et la logique non formelle.

source: المنطق الصوري هو الحقل المهيمن تقليديًا، وبعض علماء المنطق يحصرون المنطق بالمنطق الصوري.
fr: Toutes deux visent à évaluer la validité des arguments. Toutefois, la logique formelle, centrée sur les structures rigoureuses, demeure historiquement dominante.

source: اكتشف على موقعنا كيف يتم تفسير كلمة "منطق" وترجمتها واستخدامها بلغات مختلفة مثل الإنجليزية والعربية والصينية والفرنسية والبرتغالية.
fr: Certains spécialistes limitent même le concept de logique à cette seule approche. Découvrez sur notre site comment le mot "logique" est interprété, traduit et utilisé dans différentes langues comme l'anglais, l'arabe, le chinois, le français et le portugais.
